Repository: pingfangx/TranslatorX-other
Catalog: AndroidGuide/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You have to invalidate the view after any change to its properties that might change its appearance, so that the system knows that it needs to be redrawn.
zh_cn: 在对可能更改其外观的属性进行任何更改后，必须使 view 无效，以便系统知道需要重新绘制该 view。

source: You just need to make sure to check the current API level at runtime, and omit the calls to the view animation system if the current level is less than 11.
zh_cn: 你只需确保在运行时检查当前 API 级别，如果当前级别小于 11，则忽略对 view 动画系统的调用。

source: You might also create your own properties with accessors and modifiers, for example, allow the EditText value to be set initially in the component and query for its contents when needed.
zh_cn: 你也可以创建你自己属性的访问和修改方法，比如允许设置 EditText 的初始值或当需要时获取它的内容。

source: You might need to make some adjustments to be sure the layout responds as you intend for different screen sizes and orientations.
zh_cn: 你可能需要进行一些调整，以确保布局响应你打算为不同的屏幕尺寸和方向。

source: You might override other on... methods, like onKeyDown(), to perhaps choose certain default values from the popup list of a combo box when a certain key is pressed.
zh_cn: 你可能要重写一些 on... 方法，比如重写 onKeyDown() 方法，当某个按键按下时，从 combo box 的 popup list 中选择某个值。

source: You must handle the padding values when you calculate your view's size.
zh_cn: 在计算 view 大小时，必须处理 padding 值。

source: You normally define animated vector drawables in three XML files:
zh_cn: 通常在三个 XML 文件中定义动画 vector drawable：

source: You normally do not use this class directly as it only provides minimal functionality that must be extended to fully support animating values.
zh_cn: 通常不直接使用该类，因为它只提供必须扩展以完全支持动画值的最小功能。

source: You should never make assumptions about the size of your view on the screen.
zh_cn: 你永远不应该在屏幕上对 view 的大小做出假设。

source: You specify a specific dimension in the text box below or by resizing the view in the editor.
zh_cn: 你可以在下面的文本框中指定特定的尺寸，也可以在编辑器中调整 view 大小。

source: You then create a Transition to tell the system what type of animation you want, and then call TransitionManager.go() and the system runs the animation to swap the layouts.
zh_cn: 然后，创建一个 Transition 以告诉系统你想要什么类型的动画，然后调用 TransitionManager.go() 并运行该动画以交换布局。

source: You use the predefined constants to read the attributes from the TypedArray.
zh_cn: 你可以使用预定义常量从 TypedArray 中读取属性。

source: You want to use ObjectAnimator most of the time, because it makes the process of animating values on target objects much easier.
zh_cn: 大多数情况下，你都希望使用 ObjectAnimator ，因为它使对目标对象上的值设置动画的过程更加容易。

source: You will almost certainly want to override onMeasure() and are also likely to need to override onDraw() if you want the component to show something.
zh_cn: 如果你想要你的组件显示一些东西，几乎可以肯定你需要重写 onMeasure() 和 onDraw() 方法。

source: You will probably want to create your own event listeners, property accessors and modifiers, and possibly more sophisticated behavior in your component class as well.
zh_cn: 你也可以在你的组件类中创建自己的事件监听器，属性的获取、设置方法，也可能更复杂的行为。

source: Your component's onMeasure() method should calculate a measurement width and height which will be required to render the component.
zh_cn: 你的组件的 onMeasure() 方法将计算出一个测量的宽度和高度，以用来呈现该组件。

source: Your custom view can also extend View directly, or you can save time by extending one of the existing view subclasses, such as Button.
zh_cn: 你的自定义 view 也可以直接继承 View，或者你可以通过继承其中一个现有 view 子类来节省时间，例如 Button。

source: Your custom view should support the widest range of users.
zh_cn: 你的自定义 view 应该支持最广泛的用户。

source: attributes:
zh_cn: 属性：

source: compiled resource datatype:
zh_cn: 编译的资源数据类型：

source: elements:
zh_cn: 元素：

source: example:
zh_cn: 示例：

source: file location:
zh_cn: 文件位置：

source: is a separate feature that you can enable.
zh_cn: 是一个独立的功能，你可以启用。

source: or creates an animation by showing a sequence of images in order with an AnimationDrawable.
zh_cn: 使用 AnimationDrawable 创建一个按顺序显示一系列图像的动画

source: resource reference:
zh_cn: 资源引用：

source: scans the layout to determine the most effective set of constraints for all views.
zh_cn: 扫描布局以确定所有 view 的最有效的约束集合。

source: so you don't need to call findViewById() if you need to interact with the layout.
zh_cn: 因此，如果需要与布局交互，则不需要调用 findViewById()。

source: syntax:
zh_cn: 语法：
